       IDENTIFICATION DIVISION.
       PROGRAM-ID. MINISMOKE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-COUNTER PIC 9(4).
       01 WS-NAME PIC X(10).
       PROCEDURE DIVISION.
       1000-MAIN SECTION.
           MOVE 1 TO WS-COUNTER.
           PERFORM 2000-DONE.
       2000-DONE SECTION.
           MOVE 'OK' TO WS-NAME.
           GOBACK.
